Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32V873/Includes/Registers/stm32V873_fdcan.h
#define FDCAN_PSR_TDCV                  (0x7Fu<<16)
#define FDCAN_PSR_TDCV_0                (0x1u<<16)
#define FDCAN_PSR_PXE                   (0x1u<<14)
#define FDCAN_PSR_REDL                  (0x1u<<13)
#define FDCAN_PSR_RBRS                  (0x1u<<12)
#define FDCAN_PSR_RESI                  (0x1u<<11)
#define FDCAN_PSR_DLEC                  (0x7u<<8)
#define FDCAN_PSR_DLEC_0                (0x1u<<8)
#define FDCAN_PSR_BO                    (0x1u<<7)
#define FDCAN_PSR_EW                    (0x1u<<6)
#define FDCAN_PSR_EP                    (0x1u<<5)
#define FDCAN_PSR_ACT                   (0x3u<<3)
#define FDCAN_PSR_ACT_0                 (0x1u<<3)
#define FDCAN_PSR_LEC                   (0x7u<<0)
#define FDCAN_PSR_LEC_0                 (0x1u<<0)

#define FDCAN_PSR_PXE_B_0X0             (0x0u<<14)
#define FDCAN_PSR_PXE_B_0X1             (0x1u<<14)
#define FDCAN_PSR_REDL_B_0X0            (0x0u<<13)
#define FDCAN_PSR_REDL_B_0X1            (0x1u<<13)
#define FDCAN_PSR_RBRS_B_0X0            (0x0u<<12)
#define FDCAN_PSR_RBRS_B_0X1            (0x1u<<12)
#define FDCAN_PSR_RESI_B_0X0            (0x0u<<11)
#define FDCAN_PSR_RESI_B_0X1            (0x1u<<11)
#define FDCAN_PSR_BO_B_0X0              (0x0u<<7)
#define FDCAN_PSR_BO_B_0X1              (0x1u<<7)
#define FDCAN_PSR_EW_B_0X0              (0x0u<<6)
#define FDCAN_PSR_EW_B_0X1              (0x1u<<6)
#define FDCAN_PSR_EP_B_0X0              (0x0u<<5)
#define FDCAN_PSR_EP_B_0X1              (0x1u<<5)
#define FDCAN_PSR_ACT_B_0X0             (0x0u<<3)
#define FDCAN_PSR_ACT_B_0X1             (0x1u<<3)
#define FDCAN_PSR_ACT_B_0X2             (0x2u<<3)
#define FDCAN_PSR_ACT_B_0X3             (0x3u<<3)
#define FDCAN_PSR_LEC_B_0X0             (0x0u<<0)
#define FDCAN_PSR_LEC_B_0X1             (0x1u<<0)
#define FDCAN_PSR_LEC_B_0X2             (0x2u<<0)
#define FDCAN_PSR_LEC_B_0X3             (0x3u<<0)
#define FDCAN_PSR_LEC_B_0X4             (0x4u<<0)
#define FDCAN_PSR_LEC_B_0X5             (0x5u<<0)
#define FDCAN_PSR_LEC_B_0X6             (0x6u<<0)
#define FDCAN_PSR_LEC_B_0X7             (0x7u<<0)

// TDCR Configuration

#define FDCAN_TDCR_TDCO                 (0x7Fu<<8)
#define FDCAN_TDCR_TDCO_0               (0x1u<<8)
#define FDCAN_TDCR_TDCF                 (0x7Fu<<0)
#define FDCAN_TDCR_TDCF_0               (0x1u<<0)

// IR Configuration

#define FDCAN_IR_ARA                    (0x1u<<29)
#define FDCAN_IR_PED                    (0x1u<<28)
#define FDCAN_IR_PEA                    (0x1u<<27)
#define FDCAN_IR_WDI                    (0x1u<<26)
#define FDCAN_IR_BO                     (0x1u<<25)
#define FDCAN_IR_EW                     (0x1u<<24)
#define FDCAN_IR_EP                     (0x1u<<23)
#define FDCAN_IR_ELO                    (0x1u<<22)
#define FDCAN_IR_DRX                    (0x1u<<19)
#define FDCAN_IR_TOO                    (0x1u<<18)
#define FDCAN_IR_MRAF                   (0x1u<<17)
#define FDCAN_IR_TSW                    (0x1u<<16)
#define FDCAN_IR_TEFL                   (0x1u<<15)
#define FDCAN_IR_TEFF                   (0x1u<<14)
#define FDCAN_IR_TEFW                   (0x1u<<13)
#define FDCAN_IR_TEFN                   (0x1u<<12)
#define FDCAN_IR_TFE                    (0x1u<<11)
#define FDCAN_IR_TCF                    (0x1u<<10)
#define FDCAN_IR_TC                     (0x1u<<9)
#define FDCAN_IR_HPM                    (0x1u<<8)
#define FDCAN_IR_RF1L                   (0x1u<<7)
#define FDCAN_IR_RF1F                   (0x1u<<6)
#define FDCAN_IR_RF1W                   (0x1u<<5)
#define FDCAN_IR_RF1N                   (0x1u<<4)
#define FDCAN_IR_RF0L                   (0x1u<<3)
#define FDCAN_IR_RF0F                   (0x1u<<2)
#define FDCAN_IR_RF0W                   (0x1u<<1)
#define FDCAN_IR_RF0N                   (0x1u<<0)

#define FDCAN_IR_ARA_B_0X0              (0x0u<<29)
#define FDCAN_IR_ARA_B_0X1              (0x1u<<29)
#define FDCAN_IR_PED_B_0X0              (0x0u<<28)
#define FDCAN_IR_PED_B_0X1              (0x1u<<28)
#define FDCAN_IR_PEA_B_0X0              (0x0u<<27)
#define FDCAN_IR_PEA_B_0X1              (0x1u<<27)
#define FDCAN_IR_WDI_B_0X0              (0x0u<<26)
#define FDCAN_IR_WDI_B_0X1              (0x1u<<26)
#define FDCAN_IR_BO_B_0X0               (0x0u<<25)
#define FDCAN_IR_BO_B_0X1               (0x1u<<25)
#define FDCAN_IR_EW_B_0X0               (0x0u<<24)
#define FDCAN_IR_EW_B_0X1               (0x1u<<24)
#define FDCAN_IR_EP_B_0X0               (0x0u<<23)
#define FDCAN_IR_EP_B_0X1               (0x1u<<23)
#define FDCAN_IR_ELO_B_0X0              (0x0u<<22)
#define FDCAN_IR_ELO_B_0X1              (0x1u<<22)
#define FDCAN_IR_DRX_B_0X0              (0x0u<<19)
#define FDCAN_IR_DRX_B_0X1              (0x1u<<19)
#define FDCAN_IR_TOO_B_0X0              (0x0u<<18)
#define FDCAN_IR_TOO_B_0X1              (0x1u<<18)
#define FDCAN_IR_MRAF_B_0X0             (0x0u<<17)
#define FDCAN_IR_MRAF_B_0X1             (0x1u<<17)
#define FDCAN_IR_TSW_B_0X0              (0x0u<<16)
#define FDCAN_IR_TSW_B_0X1              (0x1u<<16)
#define FDCAN_IR_TEFL_B_0X0             (0x0u<<15)
#define FDCAN_IR_TEFL_B_0X1             (0x1u<<15)
#define FDCAN_IR_TEFF_B_0X0             (0x0u<<14)
#define FDCAN_IR_TEFF_B_0X1             (0x1u<<14)
#define FDCAN_IR_TEFW_B_0X0             (0x0u<<13)
#define FDCAN_IR_TEFW_B_0X1             (0x1u<<13)
#define FDCAN_IR_TEFN_B_0X0             (0x0u<<12)
#define FDCAN_IR_TEFN_B_0X1             (0x1u<<12)
#define FDCAN_IR_TFE_B_0X0              (0x0u<<11)
#define FDCAN_IR_TFE_B_0X1              (0x1u<<11)
#define FDCAN_IR_TCF_B_0X0              (0x0u<<10)
#define FDCAN_IR_TCF_B_0X1              (0x1u<<10)
#define FDCAN_IR_TC_B_0X0               (0x0u<<9)
#define FDCAN_IR_TC_B_0X1               (0x1u<<9)
#define FDCAN_IR_HPM_B_0X0              (0x0u<<8)
#define FDCAN_IR_HPM_B_0X1              (0x1u<<8)
#define FDCAN_IR_RF1L_B_0X0             (0x0u<<7)
#define FDCAN_IR_RF1L_B_0X1             (0x1u<<7)
#define FDCAN_IR_RF1F_B_0X0             (0x0u<<6)
#define FDCAN_IR_RF1F_B_0X1             (0x1u<<6)
#define FDCAN_IR_RF1W_B_0X0             (0x0u<<5)
#define FDCAN_IR_RF1W_B_0X1             (0x1u<<5)
#define FDCAN_IR_RF1N_B_0X0             (0x0u<<4)
#define FDCAN_IR_RF1N_B_0X1             (0x1u<<4)
#define FDCAN_IR_RF0L_B_0X0             (0x0u<<3)
#define FDCAN_IR_RF0L_B_0X1             (0x1u<<3)
#define FDCAN_IR_RF0F_B_0X0             (0x0u<<2)
#define FDCAN_IR_RF0F_B_0X1             (0x1u<<2)
#define FDCAN_IR_RF0W_B_0X0             (0x0u<<1)
#define FDCAN_IR_RF0W_B_0X1             (0x1u<<1)
#define FDCAN_IR_RF0N_B_0X0             (0x0u<<0)
#define FDCAN_IR_RF0N_B_0X1             (0x1u<<0)

// IE Configuration

