Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32V873/Includes/Registers/stm32V873_fdcan.h
#define FDCAN_IE_ARAE                   (0x1u<<29)
#define FDCAN_IE_PEDE                   (0x1u<<28)
#define FDCAN_IE_PEAE                   (0x1u<<27)
#define FDCAN_IE_WDIE                   (0x1u<<26)
#define FDCAN_IE_BOE                    (0x1u<<25)
#define FDCAN_IE_EWE                    (0x1u<<24)
#define FDCAN_IE_EPE                    (0x1u<<23)
#define FDCAN_IE_ELOE                   (0x1u<<22)
#define FDCAN_IE_DRXE                   (0x1u<<19)
#define FDCAN_IE_TOOE                   (0x1u<<18)
#define FDCAN_IE_MRAFE                  (0x1u<<17)
#define FDCAN_IE_TSWE                   (0x1u<<16)
#define FDCAN_IE_TEFLE                  (0x1u<<15)
#define FDCAN_IE_TEFFE                  (0x1u<<14)
#define FDCAN_IE_TEFWE                  (0x1u<<13)
#define FDCAN_IE_TEFNE                  (0x1u<<12)
#define FDCAN_IE_TFEE                   (0x1u<<11)
#define FDCAN_IE_TCFE                   (0x1u<<10)
#define FDCAN_IE_TCE                    (0x1u<<9)
#define FDCAN_IE_HPME                   (0x1u<<8)
#define FDCAN_IE_RF1LE                  (0x1u<<7)
#define FDCAN_IE_RF1FE                  (0x1u<<6)
#define FDCAN_IE_RF1WE                  (0x1u<<5)
#define FDCAN_IE_RF1NE                  (0x1u<<4)
#define FDCAN_IE_RF0LE                  (0x1u<<3)
#define FDCAN_IE_RF0FE                  (0x1u<<2)
#define FDCAN_IE_RF0WE                  (0x1u<<1)
#define FDCAN_IE_RF0NE                  (0x1u<<0)

#define FDCAN_IE_WDIE_B_0X0             (0x0u<<26)
#define FDCAN_IE_WDIE_B_0X1             (0x1u<<26)
#define FDCAN_IE_BOE_B_0X0              (0x0u<<25)
#define FDCAN_IE_BOE_B_0X1              (0x1u<<25)
#define FDCAN_IE_EWE_B_0X0              (0x0u<<24)
#define FDCAN_IE_EWE_B_0X1              (0x1u<<24)
#define FDCAN_IE_EPE_B_0X0              (0x0u<<23)
#define FDCAN_IE_EPE_B_0X1              (0x1u<<23)
#define FDCAN_IE_ELOE_B_0X0             (0x0u<<22)
#define FDCAN_IE_ELOE_B_0X1             (0x1u<<22)
#define FDCAN_IE_DRXE_B_0X0             (0x0u<<19)
#define FDCAN_IE_DRXE_B_0X1             (0x1u<<19)
#define FDCAN_IE_TOOE_B_0X0             (0x0u<<18)
#define FDCAN_IE_TOOE_B_0X1             (0x1u<<18)
#define FDCAN_IE_MRAFE_B_0X0            (0x0u<<17)
#define FDCAN_IE_MRAFE_B_0X1            (0x1u<<17)
#define FDCAN_IE_TSWE_B_0X0             (0x0u<<16)
#define FDCAN_IE_TSWE_B_0X1             (0x1u<<16)
#define FDCAN_IE_TEFLE_B_0X0            (0x0u<<15)
#define FDCAN_IE_TEFLE_B_0X1            (0x1u<<15)
#define FDCAN_IE_TEFFE_B_0X0            (0x0u<<14)
#define FDCAN_IE_TEFFE_B_0X1            (0x1u<<14)
#define FDCAN_IE_TEFWE_B_0X0            (0x0u<<13)
#define FDCAN_IE_TEFWE_B_0X1            (0x1u<<13)
#define FDCAN_IE_TEFNE_B_0X0            (0x0u<<12)
#define FDCAN_IE_TEFNE_B_0X1            (0x1u<<12)
#define FDCAN_IE_TFEE_B_0X0             (0x0u<<11)
#define FDCAN_IE_TFEE_B_0X1             (0x1u<<11)
#define FDCAN_IE_TCFE_B_0X0             (0x0u<<10)
#define FDCAN_IE_TCFE_B_0X1             (0x1u<<10)
#define FDCAN_IE_TCE_B_0X0              (0x0u<<9)
#define FDCAN_IE_TCE_B_0X1              (0x1u<<9)
#define FDCAN_IE_HPME_B_0X0             (0x0u<<8)
#define FDCAN_IE_HPME_B_0X1             (0x1u<<8)
#define FDCAN_IE_RF1LE_B_0X0            (0x0u<<7)
#define FDCAN_IE_RF1LE_B_0X1            (0x1u<<7)
#define FDCAN_IE_RF1FE_B_0X0            (0x0u<<6)
#define FDCAN_IE_RF1FE_B_0X1            (0x1u<<6)
#define FDCAN_IE_RF1WE_B_0X0            (0x0u<<5)
#define FDCAN_IE_RF1WE_B_0X1            (0x1u<<5)
#define FDCAN_IE_RF1NE_B_0X0            (0x0u<<4)
#define FDCAN_IE_RF1NE_B_0X1            (0x1u<<4)
#define FDCAN_IE_RF0LE_B_0X0            (0x0u<<3)
#define FDCAN_IE_RF0LE_B_0X1            (0x1u<<3)
#define FDCAN_IE_RF0FE_B_0X0            (0x0u<<2)
#define FDCAN_IE_RF0FE_B_0X1            (0x1u<<2)
#define FDCAN_IE_RF0WE_B_0X0            (0x0u<<1)
#define FDCAN_IE_RF0WE_B_0X1            (0x1u<<1)
#define FDCAN_IE_RF0NE_B_0X0            (0x0u<<0)
#define FDCAN_IE_RF0NE_B_0X1            (0x1u<<0)

// ILS Configuration

#define FDCAN_ILS_ARAL                  (0x1u<<29)
#define FDCAN_ILS_PEDL                  (0x1u<<28)
#define FDCAN_ILS_PEAL                  (0x1u<<27)
#define FDCAN_ILS_WDIL                  (0x1u<<26)
#define FDCAN_ILS_BOL                   (0x1u<<25)
#define FDCAN_ILS_EWL                   (0x1u<<24)
#define FDCAN_ILS_EPL                   (0x1u<<23)
#define FDCAN_ILS_ELOL                  (0x1u<<22)
#define FDCAN_ILS_DRXL                  (0x1u<<19)
#define FDCAN_ILS_TOOL                  (0x1u<<18)
#define FDCAN_ILS_MRAFL                 (0x1u<<17)
#define FDCAN_ILS_TSWL                  (0x1u<<16)
#define FDCAN_ILS_TEFLL                 (0x1u<<15)
#define FDCAN_ILS_TEFFL                 (0x1u<<14)
#define FDCAN_ILS_TEFWL                 (0x1u<<13)
#define FDCAN_ILS_TEFNL                 (0x1u<<12)
#define FDCAN_ILS_TFEL                  (0x1u<<11)
#define FDCAN_ILS_TCFL                  (0x1u<<10)
#define FDCAN_ILS_TCL                   (0x1u<<9)
#define FDCAN_ILS_HPML                  (0x1u<<8)
#define FDCAN_ILS_RF1LL                 (0x1u<<7)
#define FDCAN_ILS_RF1FL                 (0x1u<<6)
#define FDCAN_ILS_RF1WL                 (0x1u<<5)
#define FDCAN_ILS_RF1NL                 (0x1u<<4)
#define FDCAN_ILS_RF0LL                 (0x1u<<3)
#define FDCAN_ILS_RF0FL                 (0x1u<<2)
#define FDCAN_ILS_RF0WL                 (0x1u<<1)
#define FDCAN_ILS_RF0NL                 (0x1u<<0)

// ILE Configuration

#define FDCAN_ILE_EINT1                 (0x1u<<1)
#define FDCAN_ILE_EINT0                 (0x1u<<0)

#define FDCAN_ILE_EINT1_B_0X0           (0x0u<<1)
#define FDCAN_ILE_EINT1_B_0X1           (0x1u<<1)
#define FDCAN_ILE_EINT0_B_0X0           (0x0u<<0)
#define FDCAN_ILE_EINT0_B_0X1           (0x1u<<0)

// GFC Configuration

#define FDCAN_GFC_ANFS                  (0x3u<<4)
#define FDCAN_GFC_ANFS_0                (0x1u<<4)
#define FDCAN_GFC_ANFE                  (0x3u<<2)
#define FDCAN_GFC_ANFE_0                (0x1u<<2)
#define FDCAN_GFC_RRFS                  (0x1u<<1)
#define FDCAN_GFC_RRFE                  (0x1u<<0)

