Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32V873/Includes/Registers/stm32V873_fdcan.h
#define FDCAN_RXBC_RBSA                 (0x3FFFu<<2)
#define FDCAN_RXBC_RBSA_0               (0x1u<<2)

// RXF1C Configuration

#define FDCAN_RXF1C_F1OM                (0x1u<<31)
#define FDCAN_RXF1C_F1WM                (0x7Fu<<24)
#define FDCAN_RXF1C_F1WM_0              (0x1u<<24)
#define FDCAN_RXF1C_F1S                 (0x7Fu<<16)
#define FDCAN_RXF1C_F1S_0               (0x1u<<16)
#define FDCAN_RXF1C_F1SA                (0x3FFFu<<2)
#define FDCAN_RXF1C_F1SA_0              (0x1u<<2)

#define FDCAN_RXF1C_F1OM_B_0X0          (0x0u<<31)
#define FDCAN_RXF1C_F1OM_B_0X1          (0x1u<<31)
#define FDCAN_RXF1C_F1WM_B_0X0          (0x0u<<24)
#define FDCAN_RXF1C_F1S_B_0X0           (0x0u<<16)

// RXF1S Configuration

#define FDCAN_RXF1S_DMS                 (0x3u<<30)
#define FDCAN_RXF1S_DMS_0               (0x1u<<30)
#define FDCAN_RXF1S_RF1L                (0x1u<<25)
#define FDCAN_RXF1S_F1F                 (0x1u<<24)
#define FDCAN_RXF1S_F1PI                (0x3Fu<<16)
#define FDCAN_RXF1S_F1PI_0              (0x1u<<16)
#define FDCAN_RXF1S_F1GI                (0x3Fu<<8)
#define FDCAN_RXF1S_F1GI_0              (0x1u<<8)
#define FDCAN_RXF1S_F1FL                (0x7Fu<<0)
#define FDCAN_RXF1S_F1FL_0              (0x1u<<0)

#define FDCAN_RXF1S_DMS_B_0X0           (0x0u<<30)
#define FDCAN_RXF1S_DMS_B_0X1           (0x1u<<30)
#define FDCAN_RXF1S_DMS_B_0X2           (0x2u<<30)
#define FDCAN_RXF1S_DMS_B_0X3           (0x3u<<30)
#define FDCAN_RXF1S_RF1L_B_0X0          (0x0u<<25)
#define FDCAN_RXF1S_RF1L_B_0X1          (0x1u<<25)
#define FDCAN_RXF1S_F1F_B_0X0           (0x0u<<24)
#define FDCAN_RXF1S_F1F_B_0X1           (0x1u<<24)

// RXF1A Configuration

#define FDCAN_RXF1A_F1AI                (0x3Fu<<0)
#define FDCAN_RXF1A_F1AI_0              (0x1u<<0)

// RXESC Configuration

#define FDCAN_RXESC_RBDS                (0x7u<<8)
#define FDCAN_RXESC_RBDS_0              (0x1u<<8)
#define FDCAN_RXESC_F1DS                (0x7u<<4)
#define FDCAN_RXESC_F1DS_0              (0x1u<<4)
#define FDCAN_RXESC_F0DS                (0x7u<<0)
#define FDCAN_RXESC_F0DS_0              (0x1u<<0)

#define FDCAN_RXESC_RBDS_B_0X0          (0x0u<<8)
#define FDCAN_RXESC_RBDS_B_0X1          (0x1u<<8)
#define FDCAN_RXESC_RBDS_B_0X2          (0x2u<<8)
#define FDCAN_RXESC_RBDS_B_0X3          (0x3u<<8)
#define FDCAN_RXESC_RBDS_B_0X4          (0x4u<<8)
#define FDCAN_RXESC_RBDS_B_0X5          (0x5u<<8)
#define FDCAN_RXESC_RBDS_B_0X6          (0x6u<<8)
#define FDCAN_RXESC_RBDS_B_0X7          (0x7u<<8)
#define FDCAN_RXESC_F1DS_B_0X0          (0x0u<<4)
#define FDCAN_RXESC_F1DS_B_0X1          (0x1u<<4)
#define FDCAN_RXESC_F1DS_B_0X2          (0x2u<<4)
#define FDCAN_RXESC_F1DS_B_0X3          (0x3u<<4)
#define FDCAN_RXESC_F1DS_B_0X4          (0x4u<<4)
#define FDCAN_RXESC_F1DS_B_0X5          (0x5u<<4)
#define FDCAN_RXESC_F1DS_B_0X6          (0x6u<<4)
#define FDCAN_RXESC_F1DS_B_0X7          (0x7u<<4)
#define FDCAN_RXESC_F0DS_B_0X0          (0x0u<<0)
#define FDCAN_RXESC_F0DS_B_0X1          (0x1u<<0)
#define FDCAN_RXESC_F0DS_B_0X2          (0x2u<<0)
#define FDCAN_RXESC_F0DS_B_0X3          (0x3u<<0)
#define FDCAN_RXESC_F0DS_B_0X4          (0x4u<<0)
#define FDCAN_RXESC_F0DS_B_0X5          (0x5u<<0)
#define FDCAN_RXESC_F0DS_B_0X6          (0x6u<<0)
#define FDCAN_RXESC_F0DS_B_0X7          (0x7u<<0)

// TXBC Configuration

#define FDCAN_TXBC_TFQM                 (0x1u<<30)
#define FDCAN_TXBC_TFQS                 (0x3Fu<<24)
#define FDCAN_TXBC_TFQS_0               (0x1u<<24)
#define FDCAN_TXBC_NDTB                 (0x3Fu<<16)
#define FDCAN_TXBC_NDTB_0               (0x1u<<16)
#define FDCAN_TXBC_TBSA                 (0x3FFFu<<2)
#define FDCAN_TXBC_TBSA_0               (0x1u<<2)

#define FDCAN_TXBC_TFQM_B_0X0           (0x0u<<30)
#define FDCAN_TXBC_TFQM_B_0X1           (0x1u<<30)
#define FDCAN_TXBC_TFQS_B_0X0           (0x0u<<24)
#define FDCAN_TXBC_NDTB_B_0X0           (0x0u<<16)

// TXFQS Configuration

#define FDCAN_TXFQS_TFQF                (0x1u<<21)
#define FDCAN_TXFQS_TFQPI               (0x1Fu<<16)
#define FDCAN_TXFQS_TFQPI_0             (0x1u<<16)
#define FDCAN_TXFQS_TFGI                (0x1Fu<<8)
#define FDCAN_TXFQS_TFGI_0              (0x1u<<8)
#define FDCAN_TXFQS_TFFL                (0x3Fu<<0)
#define FDCAN_TXFQS_TFFL_0              (0x1u<<0)

// TXESC Configuration

#define FDCAN_TXESC_TBDS                (0x7u<<0)
#define FDCAN_TXESC_TBDS_0              (0x1u<<0)

#define FDCAN_TXESC_TBDS_B_0X0          (0x0u<<0)
#define FDCAN_TXESC_TBDS_B_0X1          (0x1u<<0)
#define FDCAN_TXESC_TBDS_B_0X2          (0x2u<<0)
#define FDCAN_TXESC_TBDS_B_0X3          (0x3u<<0)
#define FDCAN_TXESC_TBDS_B_0X4          (0x4u<<0)
#define FDCAN_TXESC_TBDS_B_0X5          (0x5u<<0)
#define FDCAN_TXESC_TBDS_B_0X6          (0x6u<<0)
#define FDCAN_TXESC_TBDS_B_0X7          (0x7u<<0)

// TXBRP Configuration

#define FDCAN_TXBRP_TRP                 (0xFFFFFFFFu<<0)
#define FDCAN_TXBRP_TRP_0               (0x1u<<0)

#define FDCAN_TXBRP_TRP_B_0X0           (0x0u<<0)
#define FDCAN_TXBRP_TRP_B_0X1           (0x1u<<0)

// TXBAR Configuration

#define FDCAN_TXBAR_AR                  (0xFFFFFFFFu<<0)
#define FDCAN_TXBAR_AR_0                (0x1u<<0)

#define FDCAN_TXBAR_AR_B_0X0            (0x0u<<0)
#define FDCAN_TXBAR_AR_B_0X1            (0x1u<<0)

// TXBCR Configuration

#define FDCAN_TXBCR_CR                  (0xFFFFFFFFu<<0)
#define FDCAN_TXBCR_CR_0                (0x1u<<0)

#define FDCAN_TXBCR_CR_B_0X0            (0x0u<<0)
#define FDCAN_TXBCR_CR_B_0X1            (0x1u<<0)

// TXBTO Configuration

#define FDCAN_TXBTO_TO                  (0xFFFFFFFFu<<0)
#define FDCAN_TXBTO_TO_0                (0x1u<<0)

#define FDCAN_TXBTO_TO_B_0X0            (0x0u<<0)
#define FDCAN_TXBTO_TO_B_0X1            (0x1u<<0)

// TXBCF Configuration

#define FDCAN_TXBCF_CF                  (0xFFFFFFFFu<<0)
#define FDCAN_TXBCF_CF_0                (0x1u<<0)

#define FDCAN_TXBCF_CF_B_0X0            (0x0u<<0)
#define FDCAN_TXBCF_CF_B_0X1            (0x1u<<0)

// TXBTIE Configuration

#define FDCAN_TXBTIE_TIE                (0xFFFFFFFFu<<0)
#define FDCAN_TXBTIE_TIE_0              (0x1u<<0)

