Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32V873/Includes/Registers/stm32V873_fdcan.h
#define FDCAN_TXBTIE_TIE_B_0X0          (0x0u<<0)
#define FDCAN_TXBTIE_TIE_B_0X1          (0x1u<<0)

// TXBCIE Configuration

#define FDCAN_TXBCIE_CFIE               (0xFFFFFFFFu<<0)
#define FDCAN_TXBCIE_CFIE_0             (0x1u<<0)

#define FDCAN_TXBCIE_CFIE_B_0X0         (0x0u<<0)
#define FDCAN_TXBCIE_CFIE_B_0X1         (0x1u<<0)

// TXEFC Configuration

#define FDCAN_TXEFC_EFWM                (0x3Fu<<24)
#define FDCAN_TXEFC_EFWM_0              (0x1u<<24)
#define FDCAN_TXEFC_EFS                 (0x3Fu<<16)
#define FDCAN_TXEFC_EFS_0               (0x1u<<16)
#define FDCAN_TXEFC_EFSA                (0x3FFFu<<2)
#define FDCAN_TXEFC_EFSA_0              (0x1u<<2)

#define FDCAN_TXEFC_EFWM_B_0X0          (0x0u<<24)
#define FDCAN_TXEFC_EFS_B_0X0           (0x0u<<16)

// TXEFS Configuration

#define FDCAN_TXEFS_TEFL                (0x1u<<25)
#define FDCAN_TXEFS_EFF                 (0x1u<<24)
#define FDCAN_TXEFS_EFPI                (0x1Fu<<16)
#define FDCAN_TXEFS_EFPI_0              (0x1u<<16)
#define FDCAN_TXEFS_EFGI                (0x1Fu<<8)
#define FDCAN_TXEFS_EFGI_0              (0x1u<<8)
#define FDCAN_TXEFS_EFFL                (0x3Fu<<0)
#define FDCAN_TXEFS_EFFL_0              (0x1u<<0)

#define FDCAN_TXEFS_EFF_B_0X0           (0x0u<<24)
#define FDCAN_TXEFS_EFF_B_0X1           (0x1u<<24)

// TXEFA Configuration

#define FDCAN_TXEFA_EFAI                (0x1Fu<<0)
#define FDCAN_TXEFA_EFAI_0              (0x1u<<0)

// TTTMC Configuration

#define FDCAN_TTTMC_TME                 (0x7Fu<<16)
#define FDCAN_TTTMC_TME_0               (0x1u<<16)
#define FDCAN_TTTMC_TMSA                (0x3FFFu<<2)
#define FDCAN_TTTMC_TMSA_0              (0x1u<<2)

#define FDCAN_TTTMC_TME_B_0X0           (0x0u<<16)

// TTRMC Configuration

#define FDCAN_TTRMC_RMPS                (0x1u<<31)
#define FDCAN_TTRMC_XTD                 (0x1u<<30)
#define FDCAN_TTRMC_RID                 (0x1FFFFFFFu<<0)
#define FDCAN_TTRMC_RID_0               (0x1u<<0)

#define FDCAN_TTRMC_RMPS_B_0X0          (0x0u<<31)
#define FDCAN_TTRMC_RMPS_B_0X1          (0x1u<<31)
#define FDCAN_TTRMC_XTD_B_0X0           (0x0u<<30)
#define FDCAN_TTRMC_XTD_B_0X1           (0x1u<<30)

// TTOCF Configuration

#define FDCAN_TTOCF_EVTP                (0x1u<<26)
#define FDCAN_TTOCF_ECC                 (0x1u<<25)
#define FDCAN_TTOCF_EGTF                (0x1u<<24)
#define FDCAN_TTOCF_AWL                 (0xFFu<<16)
#define FDCAN_TTOCF_AWL_0               (0x1u<<16)
#define FDCAN_TTOCF_EECS                (0x1u<<15)
#define FDCAN_TTOCF_IRTO                (0x7Fu<<8)
#define FDCAN_TTOCF_IRTO_0              (0x1u<<8)
#define FDCAN_TTOCF_LDSDL               (0x7u<<5)
#define FDCAN_TTOCF_LDSDL_0             (0x1u<<5)
#define FDCAN_TTOCF_TM                  (0x1u<<4)
#define FDCAN_TTOCF_GEN                 (0x1u<<3)
#define FDCAN_TTOCF_OM                  (0x3u<<0)
#define FDCAN_TTOCF_OM_0                (0x1u<<0)

#define FDCAN_TTOCF_EVTP_B_0X0          (0x0u<<26)
#define FDCAN_TTOCF_EVTP_B_0X1          (0x1u<<26)
#define FDCAN_TTOCF_ECC_B_0X0           (0x0u<<25)
#define FDCAN_TTOCF_ECC_B_0X1           (0x1u<<25)
#define FDCAN_TTOCF_EGTF_B_0X0          (0x0u<<24)
#define FDCAN_TTOCF_EGTF_B_0X1          (0x1u<<24)
#define FDCAN_TTOCF_EECS_B_0X0          (0x0u<<15)
#define FDCAN_TTOCF_EECS_B_0X1          (0x1u<<15)
#define FDCAN_TTOCF_TM_B_0X0            (0x0u<<4)
#define FDCAN_TTOCF_TM_B_0X1            (0x1u<<4)
#define FDCAN_TTOCF_GEN_B_0X0           (0x0u<<3)
#define FDCAN_TTOCF_GEN_B_0X1           (0x1u<<3)
#define FDCAN_TTOCF_OM_B_0X0            (0x0u<<0)
#define FDCAN_TTOCF_OM_B_0X1            (0x1u<<0)
#define FDCAN_TTOCF_OM_B_0X2            (0x2u<<0)
#define FDCAN_TTOCF_OM_B_0X3            (0x3u<<0)

// TTMLM Configuration

#define FDCAN_TTMLM_ENTT                (0xFFFu<<16)
#define FDCAN_TTMLM_ENTT_0              (0x1u<<16)
#define FDCAN_TTMLM_TXEW                (0xFu<<8)
#define FDCAN_TTMLM_TXEW_0              (0x1u<<8)
#define FDCAN_TTMLM_CSS                 (0x3u<<6)
#define FDCAN_TTMLM_CSS_0               (0x1u<<6)
#define FDCAN_TTMLM_CCM                 (0x3Fu<<0)
#define FDCAN_TTMLM_CCM_0               (0x1u<<0)

#define FDCAN_TTMLM_CSS_B_0X0           (0x0u<<6)
#define FDCAN_TTMLM_CSS_B_0X1           (0x1u<<6)
#define FDCAN_TTMLM_CSS_B_0X2           (0x2u<<6)
#define FDCAN_TTMLM_CCM_B_0X00          (0x0u<<0)
#define FDCAN_TTMLM_CCM_B_0X01          (0x1u<<0)
#define FDCAN_TTMLM_CCM_B_0X03          (0x3u<<0)
#define FDCAN_TTMLM_CCM_B_0X07          (0x7u<<0)
#define FDCAN_TTMLM_CCM_B_0X0F          (0xFu<<0)
#define FDCAN_TTMLM_CCM_B_0X1F          (0x1Fu<<0)
#define FDCAN_TTMLM_CCM_B_0X3F          (0x3Fu<<0)

// TURCF Configuration

#define FDCAN_TURCF_ELT                 (0x1u<<31)
#define FDCAN_TURCF_DC                  (0x3FFFu<<16)
#define FDCAN_TURCF_DC_0                (0x1u<<16)
#define FDCAN_TURCF_NCL                 (0xFFFFu<<0)
#define FDCAN_TURCF_NCL_0               (0x1u<<0)

#define FDCAN_TURCF_ELT_B_0X0           (0x0u<<31)
#define FDCAN_TURCF_ELT_B_0X1           (0x1u<<31)
#define FDCAN_TURCF_DC_B_0X0000         (0x0u<<16)

// TTOCN Configuration

#define FDCAN_TTOCN_LCKC                (0x1u<<15)
#define FDCAN_TTOCN_ESCN                (0x1u<<13)
#define FDCAN_TTOCN_NIG                 (0x1u<<12)
#define FDCAN_TTOCN_TMG                 (0x1u<<11)
#define FDCAN_TTOCN_FGP                 (0x1u<<10)
#define FDCAN_TTOCN_GCS                 (0x1u<<9)
#define FDCAN_TTOCN_TTIE                (0x1u<<8)
#define FDCAN_TTOCN_TMC                 (0x3u<<6)
#define FDCAN_TTOCN_TMC_0               (0x1u<<6)
#define FDCAN_TTOCN_RTIE                (0x1u<<5)
#define FDCAN_TTOCN_SWS                 (0x3u<<3)
#define FDCAN_TTOCN_SWS_0               (0x1u<<3)
#define FDCAN_TTOCN_SWP                 (0x1u<<2)
#define FDCAN_TTOCN_ECS                 (0x1u<<1)
#define FDCAN_TTOCN_SGT                 (0x1u<<0)

#define FDCAN_TTOCN_LCKC_B_0X0          (0x0u<<15)
#define FDCAN_TTOCN_LCKC_B_0X1          (0x1u<<15)
#define FDCAN_TTOCN_ESCN_B_0X0          (0x0u<<13)
#define FDCAN_TTOCN_ESCN_B_0X1          (0x1u<<13)
#define FDCAN_TTOCN_NIG_B_0X0           (0x0u<<12)
#define FDCAN_TTOCN_NIG_B_0X1           (0x1u<<12)
#define FDCAN_TTOCN_TMG_B_0X0           (0x0u<<11)
#define FDCAN_TTOCN_TMG_B_0X1           (0x1u<<11)
#define FDCAN_TTOCN_FGP_B_0X0           (0x0u<<10)
#define FDCAN_TTOCN_FGP_B_0X1           (0x1u<<10)
#define FDCAN_TTOCN_GCS_B_0X0           (0x0u<<9)
#define FDCAN_TTOCN_GCS_B_0X1           (0x1u<<9)
#define FDCAN_TTOCN_TTIE_B_0X0          (0x0u<<8)
#define FDCAN_TTOCN_TTIE_B_0X1          (0x1u<<8)
#define FDCAN_TTOCN_TMC_B_0X0           (0x0u<<6)
#define FDCAN_TTOCN_TMC_B_0X1           (0x1u<<6)
#define FDCAN_TTOCN_TMC_B_0X2           (0x2u<<6)
#define FDCAN_TTOCN_TMC_B_0X3           (0x3u<<6)
#define FDCAN_TTOCN_RTIE_B_0X0          (0x0u<<5)
#define FDCAN_TTOCN_RTIE_B_0X1          (0x1u<<5)
#define FDCAN_TTOCN_SWS_B_0X0           (0x0u<<3)
#define FDCAN_TTOCN_SWS_B_0X1           (0x1u<<3)
#define FDCAN_TTOCN_SWS_B_0X2           (0x2u<<3)
#define FDCAN_TTOCN_SWS_B_0X3           (0x3u<<3)
#define FDCAN_TTOCN_SWP_B_0X0           (0x0u<<2)
#define FDCAN_TTOCN_SWP_B_0X1           (0x1u<<2)

// TTGTP Configuration

#define FDCAN_TTGTP_CTP                 (0xFFFFu<<16)
#define FDCAN_TTGTP_CTP_0               (0x1u<<16)
#define FDCAN_TTGTP_TP                  (0xFFFFu<<0)
#define FDCAN_TTGTP_TP_0                (0x1u<<0)

// TTTMK Configuration

