Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32V873/Includes/Registers/stm32V873_fdcan.h
#define FDCAN_TTTMK_LCKM                (0x1u<<31)
#define FDCAN_TTTMK_TICC                (0x7Fu<<16)
#define FDCAN_TTTMK_TICC_0              (0x1u<<16)
#define FDCAN_TTTMK_TM                  (0xFFFFu<<0)
#define FDCAN_TTTMK_TM_0                (0x1u<<0)

#define FDCAN_TTTMK_LCKM_B_0X0          (0x0u<<31)
#define FDCAN_TTTMK_LCKM_B_0X1          (0x1u<<31)

// TTIR Configuration

#define FDCAN_TTIR_CER                  (0x1u<<18)
#define FDCAN_TTIR_AW                   (0x1u<<17)
#define FDCAN_TTIR_WT                   (0x1u<<16)
#define FDCAN_TTIR_IWTG                 (0x1u<<15)
#define FDCAN_TTIR_ELC                  (0x1u<<14)
#define FDCAN_TTIR_SE2                  (0x1u<<13)
#define FDCAN_TTIR_SE1                  (0x1u<<12)
#define FDCAN_TTIR_TXO                  (0x1u<<11)
#define FDCAN_TTIR_TXU                  (0x1u<<10)
#define FDCAN_TTIR_GTE                  (0x1u<<9)
#define FDCAN_TTIR_GTD                  (0x1u<<8)
#define FDCAN_TTIR_GTW                  (0x1u<<7)
#define FDCAN_TTIR_SWE                  (0x1u<<6)
#define FDCAN_TTIR_TTMI                 (0x1u<<5)
#define FDCAN_TTIR_RTMI                 (0x1u<<4)
#define FDCAN_TTIR_SOG                  (0x1u<<3)
#define FDCAN_TTIR_CSM                  (0x1u<<2)
#define FDCAN_TTIR_SMC                  (0x1u<<1)
#define FDCAN_TTIR_SBC                  (0x1u<<0)

#define FDCAN_TTIR_CER_B_0X0            (0x0u<<18)
#define FDCAN_TTIR_CER_B_0X1            (0x1u<<18)
#define FDCAN_TTIR_AW_B_0X0             (0x0u<<17)
#define FDCAN_TTIR_AW_B_0X1             (0x1u<<17)
#define FDCAN_TTIR_WT_B_0X0             (0x0u<<16)
#define FDCAN_TTIR_WT_B_0X1             (0x1u<<16)
#define FDCAN_TTIR_ELC_B_0X0            (0x0u<<14)
#define FDCAN_TTIR_ELC_B_0X1            (0x1u<<14)
#define FDCAN_TTIR_SE2_B_0X0            (0x0u<<13)
#define FDCAN_TTIR_SE2_B_0X1            (0x1u<<13)
#define FDCAN_TTIR_SE1_B_0X0            (0x0u<<12)
#define FDCAN_TTIR_SE1_B_0X1            (0x1u<<12)
#define FDCAN_TTIR_TXO_B_0X0            (0x0u<<11)
#define FDCAN_TTIR_TXO_B_0X1            (0x1u<<11)
#define FDCAN_TTIR_TXU_B_0X0            (0x0u<<10)
#define FDCAN_TTIR_TXU_B_0X1            (0x1u<<10)
#define FDCAN_TTIR_GTE_B_0X0            (0x0u<<9)
#define FDCAN_TTIR_GTE_B_0X1            (0x1u<<9)
#define FDCAN_TTIR_GTD_B_0X0            (0x0u<<8)
#define FDCAN_TTIR_GTD_B_0X1            (0x1u<<8)
#define FDCAN_TTIR_GTW_B_0X0            (0x0u<<7)
#define FDCAN_TTIR_GTW_B_0X1            (0x1u<<7)
#define FDCAN_TTIR_SWE_B_0X0            (0x0u<<6)
#define FDCAN_TTIR_SWE_B_0X1            (0x1u<<6)
#define FDCAN_TTIR_TTMI_B_0X0           (0x0u<<5)
#define FDCAN_TTIR_TTMI_B_0X1           (0x1u<<5)
#define FDCAN_TTIR_RTMI_B_0X0           (0x0u<<4)
#define FDCAN_TTIR_RTMI_B_0X1           (0x1u<<4)
#define FDCAN_TTIR_CSM_B_0X0            (0x0u<<2)
#define FDCAN_TTIR_CSM_B_0X1            (0x1u<<2)
#define FDCAN_TTIR_SMC_B_0X0            (0x0u<<1)
#define FDCAN_TTIR_SMC_B_0X1            (0x1u<<1)
#define FDCAN_TTIR_SBC_B_0X0            (0x0u<<0)
#define FDCAN_TTIR_SBC_B_0X1            (0x1u<<0)

// TTIE Configuration

#define FDCAN_TTIE_CERE                 (0x1u<<18)
#define FDCAN_TTIE_AWE                  (0x1u<<17)
#define FDCAN_TTIE_WTE                  (0x1u<<16)
#define FDCAN_TTIE_IWTE                 (0x1u<<15)
#define FDCAN_TTIE_ELCE                 (0x1u<<14)
#define FDCAN_TTIE_SE2E                 (0x1u<<13)
#define FDCAN_TTIE_SE1E                 (0x1u<<12)
#define FDCAN_TTIE_TXOE                 (0x1u<<11)
#define FDCAN_TTIE_TXUE                 (0x1u<<10)
#define FDCAN_TTIE_GTEE                 (0x1u<<9)
#define FDCAN_TTIE_GTDE                 (0x1u<<8)
#define FDCAN_TTIE_GTWE                 (0x1u<<7)
#define FDCAN_TTIE_SWEE                 (0x1u<<6)
#define FDCAN_TTIE_TTMIE                (0x1u<<5)
#define FDCAN_TTIE_RTMIE                (0x1u<<4)
#define FDCAN_TTIE_SOGE                 (0x1u<<3)
#define FDCAN_TTIE_CSME                 (0x1u<<2)
#define FDCAN_TTIE_SMCE                 (0x1u<<1)
#define FDCAN_TTIE_SBCE                 (0x1u<<0)

#define FDCAN_TTIE_CERE_B_0X0           (0x0u<<18)
#define FDCAN_TTIE_CERE_B_0X1           (0x1u<<18)
#define FDCAN_TTIE_AWE_B_0X0            (0x0u<<17)
#define FDCAN_TTIE_AWE_B_0X1            (0x1u<<17)
#define FDCAN_TTIE_WTE_B_0X0            (0x0u<<16)
#define FDCAN_TTIE_WTE_B_0X1            (0x1u<<16)
#define FDCAN_TTIE_IWTE_B_0X0           (0x0u<<15)
#define FDCAN_TTIE_IWTE_B_0X1           (0x1u<<15)
#define FDCAN_TTIE_ELCE_B_0X0           (0x0u<<14)
#define FDCAN_TTIE_ELCE_B_0X1           (0x1u<<14)
#define FDCAN_TTIE_SE2E_B_0X0           (0x0u<<13)
#define FDCAN_TTIE_SE2E_B_0X1           (0x1u<<13)
#define FDCAN_TTIE_SE1E_B_0X0           (0x0u<<12)
#define FDCAN_TTIE_SE1E_B_0X1           (0x1u<<12)
#define FDCAN_TTIE_TXOE_B_0X0           (0x0u<<11)
#define FDCAN_TTIE_TXOE_B_0X1           (0x1u<<11)
#define FDCAN_TTIE_TXUE_B_0X0           (0x0u<<10)
#define FDCAN_TTIE_TXUE_B_0X1           (0x1u<<10)
#define FDCAN_TTIE_GTEE_B_0X0           (0x0u<<9)
#define FDCAN_TTIE_GTEE_B_0X1           (0x1u<<9)
#define FDCAN_TTIE_GTDE_B_0X0           (0x0u<<8)
#define FDCAN_TTIE_GTDE_B_0X1           (0x1u<<8)
#define FDCAN_TTIE_GTWE_B_0X0           (0x0u<<7)
#define FDCAN_TTIE_GTWE_B_0X1           (0x1u<<7)
#define FDCAN_TTIE_SWEE_B_0X0           (0x0u<<6)
#define FDCAN_TTIE_SWEE_B_0X1           (0x1u<<6)
#define FDCAN_TTIE_TTMIE_B_0X0          (0x0u<<5)
#define FDCAN_TTIE_TTMIE_B_0X1          (0x1u<<5)
#define FDCAN_TTIE_RTMIE_B_0X0          (0x0u<<4)
#define FDCAN_TTIE_RTMIE_B_0X1          (0x1u<<4)
#define FDCAN_TTIE_SOGE_B_0X0           (0x0u<<3)
#define FDCAN_TTIE_SOGE_B_0X1           (0x1u<<3)
#define FDCAN_TTIE_CSME_B_0X0           (0x0u<<2)
#define FDCAN_TTIE_CSME_B_0X1           (0x1u<<2)
#define FDCAN_TTIE_SMCE_B_0X0           (0x0u<<1)
#define FDCAN_TTIE_SMCE_B_0X1           (0x1u<<1)
#define FDCAN_TTIE_SBCE_B_0X0           (0x0u<<0)
#define FDCAN_TTIE_SBCE_B_0X1           (0x1u<<0)

// TTILS Configuration

#define FDCAN_TTILS_CERL                (0x1u<<18)
#define FDCAN_TTILS_AWL                 (0x1u<<17)
#define FDCAN_TTILS_WTL                 (0x1u<<16)
#define FDCAN_TTILS_IWTL                (0x1u<<15)
#define FDCAN_TTILS_ELCL                (0x1u<<14)
#define FDCAN_TTILS_SE2L                (0x1u<<13)
#define FDCAN_TTILS_SE1L                (0x1u<<12)
#define FDCAN_TTILS_TXOL                (0x1u<<11)
#define FDCAN_TTILS_TXUL                (0x1u<<10)
#define FDCAN_TTILS_GTEL                (0x1u<<9)
#define FDCAN_TTILS_GTDL                (0x1u<<8)
#define FDCAN_TTILS_GTWL                (0x1u<<7)
#define FDCAN_TTILS_SWEL                (0x1u<<6)
#define FDCAN_TTILS_TTMIL               (0x1u<<5)
#define FDCAN_TTILS_RTMIL               (0x1u<<4)
#define FDCAN_TTILS_SOGL                (0x1u<<3)
#define FDCAN_TTILS_CSML                (0x1u<<2)
#define FDCAN_TTILS_SMCL                (0x1u<<1)
#define FDCAN_TTILS_SBCL                (0x1u<<0)

#define FDCAN_TTILS_CERL_B_0X0          (0x0u<<18)
#define FDCAN_TTILS_CERL_B_0X1          (0x1u<<18)
#define FDCAN_TTILS_AWL_B_0X0           (0x0u<<17)
#define FDCAN_TTILS_AWL_B_0X1           (0x1u<<17)
#define FDCAN_TTILS_WTL_B_0X0           (0x0u<<16)
#define FDCAN_TTILS_WTL_B_0X1           (0x1u<<16)
#define FDCAN_TTILS_IWTL_B_0X0          (0x0u<<15)
#define FDCAN_TTILS_IWTL_B_0X1          (0x1u<<15)
#define FDCAN_TTILS_ELCL_B_0X0          (0x0u<<14)
#define FDCAN_TTILS_ELCL_B_0X1          (0x1u<<14)
#define FDCAN_TTILS_SE2L_B_0X0          (0x0u<<13)
#define FDCAN_TTILS_SE2L_B_0X1          (0x1u<<13)
#define FDCAN_TTILS_SE1L_B_0X0          (0x0u<<12)
#define FDCAN_TTILS_SE1L_B_0X1          (0x1u<<12)
#define FDCAN_TTILS_TXOL_B_0X0          (0x0u<<11)
#define FDCAN_TTILS_TXOL_B_0X1          (0x1u<<11)
#define FDCAN_TTILS_TXUL_B_0X0          (0x0u<<10)
#define FDCAN_TTILS_TXUL_B_0X1          (0x1u<<10)
#define FDCAN_TTILS_GTEL_B_0X0          (0x0u<<9)
#define FDCAN_TTILS_GTEL_B_0X1          (0x1u<<9)
#define FDCAN_TTILS_GTDL_B_0X0          (0x0u<<8)
#define FDCAN_TTILS_GTDL_B_0X1          (0x1u<<8)
#define FDCAN_TTILS_GTWL_B_0X0          (0x0u<<7)
#define FDCAN_TTILS_GTWL_B_0X1          (0x1u<<7)
#define FDCAN_TTILS_SWEL_B_0X0          (0x0u<<6)
#define FDCAN_TTILS_SWEL_B_0X1          (0x1u<<6)
#define FDCAN_TTILS_TTMIL_B_0X0         (0x0u<<5)
#define FDCAN_TTILS_TTMIL_B_0X1         (0x1u<<5)
#define FDCAN_TTILS_RTMIL_B_0X0         (0x0u<<4)
#define FDCAN_TTILS_RTMIL_B_0X1         (0x1u<<4)
#define FDCAN_TTILS_SOGL_B_0X0          (0x0u<<3)
#define FDCAN_TTILS_SOGL_B_0X1          (0x1u<<3)
#define FDCAN_TTILS_CSML_B_0X0          (0x0u<<2)
#define FDCAN_TTILS_CSML_B_0X1          (0x1u<<2)
#define FDCAN_TTILS_SMCL_B_0X0          (0x0u<<1)
#define FDCAN_TTILS_SMCL_B_0X1          (0x1u<<1)
#define FDCAN_TTILS_SBCL_B_0X0          (0x0u<<0)
#define FDCAN_TTILS_SBCL_B_0X1          (0x1u<<0)

// TTOST Configuration

#define FDCAN_TTOST_SPL                 (0x1u<<31)
#define FDCAN_TTOST_WECS                (0x1u<<30)
#define FDCAN_TTOST_AWE                 (0x1u<<29)
#define FDCAN_TTOST_WFE                 (0x1u<<28)
#define FDCAN_TTOST_GSI                 (0x1u<<27)
#define FDCAN_TTOST_TMP                 (0x7u<<24)
#define FDCAN_TTOST_TMP_0               (0x1u<<24)
#define FDCAN_TTOST_GFI                 (0x1u<<23)
#define FDCAN_TTOST_WGTD                (0x1u<<22)
#define FDCAN_TTOST_RTO                 (0xFFu<<8)
#define FDCAN_TTOST_RTO_0               (0x1u<<8)
#define FDCAN_TTOST_QCS                 (0x1u<<7)
#define FDCAN_TTOST_QGTP                (0x1u<<6)
#define FDCAN_TTOST_SYS                 (0x3u<<4)
#define FDCAN_TTOST_SYS_0               (0x1u<<4)
#define FDCAN_TTOST_MS                  (0x3u<<2)
#define FDCAN_TTOST_MS_0                (0x1u<<2)
#define FDCAN_TTOST_EL                  (0x3u<<0)
#define FDCAN_TTOST_EL_0                (0x1u<<0)

