Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32V873/Includes/Registers/stm32V873_fdcan.h
#define FDCAN_TTOST_SPL_B_0X0           (0x0u<<31)
#define FDCAN_TTOST_SPL_B_0X1           (0x1u<<31)
#define FDCAN_TTOST_WECS_B_0X0          (0x0u<<30)
#define FDCAN_TTOST_WECS_B_0X1          (0x1u<<30)
#define FDCAN_TTOST_AWE_B_0X0           (0x0u<<29)
#define FDCAN_TTOST_AWE_B_0X1           (0x1u<<29)
#define FDCAN_TTOST_WFE_B_0X0           (0x0u<<28)
#define FDCAN_TTOST_WFE_B_0X1           (0x1u<<28)
#define FDCAN_TTOST_GSI_B_0X0           (0x0u<<27)
#define FDCAN_TTOST_GSI_B_0X1           (0x1u<<27)
#define FDCAN_TTOST_GFI_B_0X0           (0x0u<<23)
#define FDCAN_TTOST_GFI_B_0X1           (0x1u<<23)
#define FDCAN_TTOST_WGTD_B_0X0          (0x0u<<22)
#define FDCAN_TTOST_WGTD_B_0X1          (0x1u<<22)
#define FDCAN_TTOST_QCS_B_0X0           (0x0u<<7)
#define FDCAN_TTOST_QCS_B_0X1           (0x1u<<7)
#define FDCAN_TTOST_QGTP_B_0X0          (0x0u<<6)
#define FDCAN_TTOST_QGTP_B_0X1          (0x1u<<6)
#define FDCAN_TTOST_SYS_B_0X0           (0x0u<<4)
#define FDCAN_TTOST_SYS_B_0X1           (0x1u<<4)
#define FDCAN_TTOST_SYS_B_0X2           (0x2u<<4)
#define FDCAN_TTOST_SYS_B_0X3           (0x3u<<4)
#define FDCAN_TTOST_MS_B_0X0            (0x0u<<2)
#define FDCAN_TTOST_MS_B_0X1            (0x1u<<2)
#define FDCAN_TTOST_MS_B_0X2            (0x2u<<2)
#define FDCAN_TTOST_MS_B_0X3            (0x3u<<2)
#define FDCAN_TTOST_EL_B_0X0            (0x0u<<0)
#define FDCAN_TTOST_EL_B_0X1            (0x1u<<0)
#define FDCAN_TTOST_EL_B_0X2            (0x2u<<0)
#define FDCAN_TTOST_EL_B_0X3            (0x3u<<0)

// TURNA Configuration

#define FDCAN_TURNA_NAV                 (0x3FFFFu<<0)
#define FDCAN_TURNA_NAV_0               (0x1u<<0)

#define FDCAN_TURNA_NAV_B_0X0EFFF       (0xEFFFu<<0)
#define FDCAN_TURNA_NAV_B_0X21000       (0x21000u<<0)

// TTLGT Configuration

#define FDCAN_TTLGT_GT                  (0xFFFFu<<16)
#define FDCAN_TTLGT_GT_0                (0x1u<<16)
#define FDCAN_TTLGT_LT                  (0xFFFFu<<0)
#define FDCAN_TTLGT_LT_0                (0x1u<<0)

// TTCTC Configuration

#define FDCAN_TTCTC_CC                  (0x3Fu<<16)
#define FDCAN_TTCTC_CC_0                (0x1u<<16)
#define FDCAN_TTCTC_CT                  (0xFFFFu<<0)
#define FDCAN_TTCTC_CT_0                (0x1u<<0)

// TTCPT Configuration

#define FDCAN_TTCPT_SWV                 (0xFFFFu<<16)
#define FDCAN_TTCPT_SWV_0               (0x1u<<16)
#define FDCAN_TTCPT_CCV                 (0x3Fu<<0)
#define FDCAN_TTCPT_CCV_0               (0x1u<<0)

// TTCSM Configuration

#define FDCAN_TTCSM_CSM                 (0xFFFFu<<0)
#define FDCAN_TTCSM_CSM_0               (0x1u<<0)

// TTTS Configuration

#define FDCAN_TTTS_EVTSEL               (0x3u<<4)
#define FDCAN_TTTS_EVTSEL_0             (0x1u<<4)
#define FDCAN_TTTS_SWTDEL               (0x3u<<0)
#define FDCAN_TTTS_SWTDEL_0             (0x1u<<0)

#define FDCAN_TTTS_EVTSEL_B_0X0         (0x0u<<4)
#define FDCAN_TTTS_EVTSEL_B_0X1         (0x1u<<4)
#define FDCAN_TTTS_EVTSEL_B_0X2         (0x2u<<4)
#define FDCAN_TTTS_EVTSEL_B_0X3         (0x3u<<4)
#define FDCAN_TTTS_SWTDEL_B_0X0         (0x0u<<0)
#define FDCAN_TTTS_SWTDEL_B_0X1         (0x1u<<0)
#define FDCAN_TTTS_SWTDEL_B_0X2         (0x2u<<0)
#define FDCAN_TTTS_SWTDEL_B_0X3         (0x3u<<0)
